---
kind: type
id: T:Autodesk.Revit.DB.FilterGlobalParameterAssociationRule
source: html/058d0d01-ccdd-b231-ee84-400cb041361e.htm
---
# Autodesk.Revit.DB.FilterGlobalParameterAssociationRule

A filter rule that operates on global parameters ElementId values in a Revit project.

## Syntax (C#)
```csharp
public class FilterGlobalParameterAssociationRule : FilterNumericValueRule
```